Revit 2027 API
BuiltInFailures.StairRampFailures.WinderRunInsideWalklineOffsetFailure Property
 Please enter a value between 0 and half of Actual Run Width (%1/2 Actual Run Width%).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderRunInsideWalklineOffsetFailure { get; }
Public Shared ReadOnly Property WinderRunInsideWalklineOffsetFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderRunInsideWalklineOffsetFailure {
	FailureDefinitionId^ get ();
}
static member WinderRunInsideWalklineOffsetFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace